# Leçon SQL 11: Requêtes avec des agrégats (Pt. 2)

Nos requêtes deviennent assez complexes, mais nous avons presque introduit toutes les parties importantes d'une requête SELECT. Une chose que vous avez peut-être remarqué est que si la clause GROUP BY est exécutée après la clause WHERE (qui filtre les lignes à grouper), comment filtrer exactement les lignes groupées?

Heureusement, SQL nous permet de le faire en ajoutant une clause **HAVING** supplémentaire qui est utilisée spécifiquement avec la clause **GROUP BY** pour nous permettre de filtrer les lignes groupées de l'ensemble de résultats.

Sélectionnez la requête avec la contrainte HAVING
``` mysql 
SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, …
FROM mytable
WHERE condition
GROUP BY column
HAVING group_condition;
```

Les contraintes de la clause **HAVING** sont écrites de la même manière que les contraintes de la clause **WHERE** et sont appliquées aux lignes groupées. 

Avec nos exemples, cela peut ne pas sembler être une construction particulièrement utile, mais si vous imaginez des données avec des millions de lignes avec des propriétés différentes, il est souvent nécessaire de pouvoir appliquer des contraintes supplémentaires pour donner rapidement un sens aux données.

**Le saviez-vous?** Si vous n'utilisez pas la clause `GROUP BY`, une simple clause` WHERE` suffira.

## Exercice

Pour cet exercice, vous allez approfondir les données des **employes** du studio de cinéma. Pensez aux différentes clauses que vous souhaitez appliquer pour chaque tâche.

In [13]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [14]:
from pandasql import sqldf

In [15]:
x="""Role	Name	Building	Years_employed
Engineer	Becky A.	1e	4
Engineer	Dan B.	1e	2
Engineer	Sharon F.	1e	6
Engineer	Dan M.	1e	4
Engineer	Malcom S.	1e	1
Artist	Tylar S.	2w	2
Artist	Sherman D.	2w	8
Artist	Jakob J.	2w	6
Artist	Lillia A.	2w	7
Artist	Brandon J.	2w	7
Manager	Scott K.	1e	9
Manager	Shirlee M.	1e	3
Manager	Daria O.	2w	6"""

In [16]:
employes = to_df(x) #employees

1. Trouvez le nombre d'artistes dans l'atelier (sans clause HAVING )

In [17]:
QUERY1 = "SELECT COUNT(*) Artiste_count FROM employes WHERE Role = 'Artist'"

In [8]:
sqldf(QUERY1)

   Artiste_count
0              5

2. Trouvez le nombre d'employés de chaque rôle dans le studio

In [9]:
QUERY2 = "SELECT Role, COUNT(*) AS Number FROM employes GROUP BY Role"

In [10]:
sqldf(QUERY2)

       Role  Number
0    Artist       5
1  Engineer       5
2   Manager       3

3. Trouvez le nombre total d'années d'emploi de tous les ingénieurs

In [20]:
QUERY3 = "SELECT SUM(Years_employed) AS total_year FROM employes WHERE Role = 'Engineer'"

In [21]:
sqldf(QUERY3)

   total_year
0          17